// Завдання 1  Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

const time = +prompt('введіть годину')

if (time < 15) {
    console.log('перша чверть години')
}
else if (time >=15 && time <=30) {
    console.log('друга чверть години')
}
else if (time >30 && time <= 45) {
    console.log('третя чверть години')
}
else if (time >45 && time <60) {
    console.log('четверта чверть години')
}

// Завдання 2 У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

 let day = +prompt('Введіть число')
 if (day <=10) {
     console.log('перша декада місяця')
 }
 else if(day >=11 && day <=20) {
     console.log('друга декада місяця')
 }
 else if(day >=21 && day <=31) {
     console.log('третя декада місяця')
 }

 // Завдання 3  У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test = prompt('Введіть число')
if (!!test) {
    console.log("Вірно")
}
else {
    console.log('Не правильно')
}

let test1 = confirm('!!!') ? 'Вірно' : 'Не правильно'
console.log(test1)

 //Завдання 4 Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = +prompt('Введіть число')
if (a !== 0) {
console.log('вірно')
}
else {
    console.log('не вірно')
}

a !== 0 ? console.log('вірно') : console.log('не вірно')

 // Завдання 5 Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день

let schedule = +prompt('Введіть день тиждня')
switch (schedule) {
    case 1:
        console.log('фізкультура')
        break
    case 2:
        console.log('алгебра')
        break
    case 3:
        console.log('креслення')
        break
    case 4:
        console.log('геометрія')
        break
    case 5:
        console.log('біологія')
        break
    case 6:
        console.log('англійська')
        break
    case 7:
        console.log('німецька')
}

 // Завдання 6 Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

let year = +prompt('введіть рік')
if(year % 4 === 0) {
    console.log('високосний')
}
else {
    console.log('не високосний')
}

 // Завдання 7 Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let js = prompt('введіть офіційну назву JavaScript')
if (js === 'ECMAScript') {
    console.log('правильно')
}
else {
    console.log('Не знаєте? ECMAScript!')
}