
// Завдання 1 Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

 let number1 = 11;
 let nam = 22;
 if (number1 > nam) {
     console.log('перше число більше')
 }
 else if (number1 < nam){
     console.log('друге число більше')
 }
 else if (number1 === nam) {
     console.log('числа одинакові')
 }

 // Завдання 2 У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

const flat = prompt('введіть номер квартири')

if (flat <= 20) {
     console.log('перший підіїзд')
}

else if (flat >=21 && flat <= 48) {
    console.log('другий підїзд')
}
else if (flat >=49 && flat <= 90) {
    console.log('третій підїзд')
}

 // Завдання 3 Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО


 let number = +prompt('введіть число');
 if (number === 10) {
  console.log("Вірно")
 }
 else if (number !== 10) {
  console.log('Не вірно')
 }

 // Завдання 4  Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

 let x = 22;
 if (typeof x==='number') {
  console.log(1)
 }
 else if(typeof x==='string') {
  console.log(2)
 }
 else if(typeof x==="boolean") {
  console.log(3)
 }
 else if(typeof x=== "object") {
  console.log(4)
 }
 else {
  console.log('else')
 }

 // Завдання 5  Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let faradey = +prompt('Введіть температуру');

 if (faradey >=10 && faradey <=22) {
 console.log('Ми йдемо ВЧИТИСЯ')
}
 else {
 console.log('Сидимо вдома і вчимося онлайн')
}


 //Завдання 6 За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .


let number = +prompt('Введіть число')
switch (number) {
 case 1:
  console.log('Auto')
  break
 case 2:
  console.log('moto')
   break
 case 3:
  console.log('phone')
        break
 case 4:
  console.log('bicyle')
        break
 case 5:
  console.log('scooter')
 default:
  console.log('Число не вірне')









}

